; domain
(define (domain the_game)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :conditional-effects)

    (:types 
        pile card - object
    )

    (:predicates
        (ascending_pile ?p - pile)
        (descending_pile ?p - pile)
        (card_in_hand ?c - card)
        (top_pile_card ?p - pile ?c - card)
        (next_card_in_deck ?c1 - card ?c2 - card)  ; Simulates list order in drawing pile
        (top_deck_card ?c - card)
        (is_drawing)
        (is_bottom_card ?c - card)
        (deck_empty)
    )

    (:functions
        (value ?c - card)
        (n_card_in_hand) 
    )

    (:action play_card
        :parameters (?c - card ?p - pile ?c_top - card)
        :precondition (and
            (card_in_hand ?c) 
            (top_pile_card ?p ?c_top) 
            (not (is_drawing))
            (or 
                (and (ascending_pile ?p) (> (value ?c) (value ?c_top)))
                (and (descending_pile ?p) (< (value ?c) (value ?c_top)))
                (and (ascending_pile ?p) (= (value ?c) (- (value ?c_top) 5)))
                (and (descending_pile ?p) (= (value ?c) (+ (value ?c_top) 5)))
            )
        )
        :effect (and
            (not (card_in_hand ?c))
            (top_pile_card ?p ?c)
            (not (top_pile_card ?p ?c_top))
            (decrease (n_card_in_hand) 1)

        )
    )

    (:action draw_card
        :parameters (?c1 - card ?c2 - card)
        :precondition (and
            (top_deck_card ?c1)
            (next_card_in_deck ?c1 ?c2)
            (<= (n_card_in_hand) 6)
            (or 
                (is_drawing)
                (<= (n_card_in_hand) 5)
            )
        )
        :effect (and
            (not (top_deck_card ?c1))
            (top_deck_card ?c2)
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (is_drawing)
        )
    )
    
    (:action stop_drawing
        :parameters ()
        :precondition (and 
            (= (n_card_in_hand) 7)
            (is_drawing)
        )
        :effect (not (is_drawing))
    )

    (:action draw_final_card
        :parameters (?c1 - card)
        :precondition (and
            (top_deck_card ?c1)
            (is_bottom_card ?c1)
        )
        :effect (and
            (not (top_deck_card ?c1))
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (not (is_drawing))
            (deck_empty)
        )
    )

)

; problem
(define (problem very_hard)
    (:domain the_game)
    (:objects
        pile0 pile1 pile2 pile3 - pile
        c_min c_max c14 c43 c16 c17 c10 c26 c32 c37 c45 c20 c31 c3 c25 c42 c6 c29 c28 c8 c2 c35 c44 c47 c48 c39 c5 c9 c41 c13 c18 c27 c23 c30 c40 c7 c11 c38 c12 c4 c22 c36 c33 c24 c15 c21 c19 c34 c46 c49 - card
    )
    (:init
        (ascending_pile pile0)
        (ascending_pile pile1)
        (descending_pile pile2)
        (descending_pile pile3)
        (top_pile_card pile0 c_min)
        (top_pile_card pile1 c_min)
        (top_pile_card pile2 c_max)
        (top_pile_card pile3 c_max)
        (top_deck_card c14)
        (next_card_in_deck c14 c43)
        (next_card_in_deck c43 c16)
        (next_card_in_deck c16 c17)
        (next_card_in_deck c17 c10)
        (next_card_in_deck c10 c26)
        (next_card_in_deck c26 c32)
        (next_card_in_deck c32 c37)
        (next_card_in_deck c37 c45)
        (next_card_in_deck c45 c20)
        (next_card_in_deck c20 c31)
        (next_card_in_deck c31 c3)
        (next_card_in_deck c3 c25)
        (next_card_in_deck c25 c42)
        (next_card_in_deck c42 c6)
        (next_card_in_deck c6 c29)
        (next_card_in_deck c29 c28)
        (next_card_in_deck c28 c8)
        (next_card_in_deck c8 c2)
        (next_card_in_deck c2 c35)
        (next_card_in_deck c35 c44)
        (next_card_in_deck c44 c47)
        (next_card_in_deck c47 c48)
        (next_card_in_deck c48 c39)
        (next_card_in_deck c39 c5)
        (next_card_in_deck c5 c9)
        (next_card_in_deck c9 c41)
        (next_card_in_deck c41 c13)
        (next_card_in_deck c13 c18)
        (next_card_in_deck c18 c27)
        (next_card_in_deck c27 c23)
        (next_card_in_deck c23 c30)
        (next_card_in_deck c30 c40)
        (next_card_in_deck c40 c7)
        (next_card_in_deck c7 c11)
        (next_card_in_deck c11 c38)
        (next_card_in_deck c38 c12)
        (next_card_in_deck c12 c4)
        (next_card_in_deck c4 c22)
        (next_card_in_deck c22 c36)
        (next_card_in_deck c36 c33)
        (next_card_in_deck c33 c24)
        (next_card_in_deck c24 c15)
        (next_card_in_deck c15 c21)
        (next_card_in_deck c21 c19)
        (next_card_in_deck c19 c34)
        (next_card_in_deck c34 c46)
        (next_card_in_deck c46 c49)
        (is_bottom_card c49)
        (= (n_card_in_hand) 0)
        (= (value c_min) 1)
        (= (value c_max) 50)
        (= (value c14) 14)
        (= (value c43) 43)
        (= (value c16) 16)
        (= (value c17) 17)
        (= (value c10) 10)
        (= (value c26) 26)
        (= (value c32) 32)
        (= (value c37) 37)
        (= (value c45) 45)
        (= (value c20) 20)
        (= (value c31) 31)
        (= (value c3) 3)
        (= (value c25) 25)
        (= (value c42) 42)
        (= (value c6) 6)
        (= (value c29) 29)
        (= (value c28) 28)
        (= (value c8) 8)
        (= (value c2) 2)
        (= (value c35) 35)
        (= (value c44) 44)
        (= (value c47) 47)
        (= (value c48) 48)
        (= (value c39) 39)
        (= (value c5) 5)
        (= (value c9) 9)
        (= (value c41) 41)
        (= (value c13) 13)
        (= (value c18) 18)
        (= (value c27) 27)
        (= (value c23) 23)
        (= (value c30) 30)
        (= (value c40) 40)
        (= (value c7) 7)
        (= (value c11) 11)
        (= (value c38) 38)
        (= (value c12) 12)
        (= (value c4) 4)
        (= (value c22) 22)
        (= (value c36) 36)
        (= (value c33) 33)
        (= (value c24) 24)
        (= (value c15) 15)
        (= (value c21) 21)
        (= (value c19) 19)
        (= (value c34) 34)
        (= (value c46) 46)
        (= (value c49) 49)
    )
    (:goal
        (and
            (deck_empty)
            (= (n_card_in_hand) 0)
        )
    )
)

; plan
1. (draw_card c14 c43)
   deleted: (top_deck_card c14)
   added: (top_deck_card c43) (card_in_hand c14) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
2. (draw_card c43 c16)
   deleted: (top_deck_card c43)
   added: (top_deck_card c16) (card_in_hand c43)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
3. (draw_card c16 c17)
   deleted: (top_deck_card c16)
   added: (top_deck_card c17) (card_in_hand c16)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
4. (draw_card c17 c10)
   deleted: (top_deck_card c17)
   added: (top_deck_card c10) (card_in_hand c17)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
5. (draw_card c10 c26)
   deleted: (top_deck_card c10)
   added: (top_deck_card c26) (card_in_hand c10)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
6. (draw_card c26 c32)
   deleted: (top_deck_card c26)
   added: (top_deck_card c32) (card_in_hand c26)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
7. (draw_card c32 c37)
   deleted: (top_deck_card c32)
   added: (top_deck_card c37) (card_in_hand c32)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
8. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
9. (play_card c32 pile2 c_max)
   deleted: (card_in_hand c32) (top_pile_card pile2 c_max)
   added: (top_pile_card pile2 c32)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
10. (play_card c14 pile2 c32)
   deleted: (card_in_hand c14) (top_pile_card pile2 c32)
   added: (top_pile_card pile2 c14)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
11. (draw_card c37 c45)
   deleted: (top_deck_card c37)
   added: (top_deck_card c45) (card_in_hand c37) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
12. (draw_card c45 c20)
   deleted: (top_deck_card c45)
   added: (top_deck_card c20) (card_in_hand c45)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
13. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
14. (play_card c45 pile0 c_min)
   deleted: (card_in_hand c45) (top_pile_card pile0 c_min)
   added: (top_pile_card pile0 c45)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
15. (play_card c37 pile3 c_max)
   deleted: (card_in_hand c37) (top_pile_card pile3 c_max)
   added: (top_pile_card pile3 c37)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
16. (draw_card c20 c31)
   deleted: (top_deck_card c20)
   added: (top_deck_card c31) (card_in_hand c20) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
17. (draw_card c31 c3)
   deleted: (top_deck_card c31)
   added: (top_deck_card c3) (card_in_hand c31)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
18. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
19. (play_card c31 pile3 c37)
   deleted: (card_in_hand c31) (top_pile_card pile3 c37)
   added: (top_pile_card pile3 c31)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
20. (play_card c20 pile3 c31)
   deleted: (card_in_hand c20) (top_pile_card pile3 c31)
   added: (top_pile_card pile3 c20)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
21. (draw_card c3 c25)
   deleted: (top_deck_card c3)
   added: (top_deck_card c25) (card_in_hand c3) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
22. (draw_card c25 c42)
   deleted: (top_deck_card c25)
   added: (top_deck_card c42) (card_in_hand c25)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
23. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
24. (play_card c25 pile3 c20)
   deleted: (card_in_hand c25) (top_pile_card pile3 c20)
   added: (top_pile_card pile3 c25)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
25. (play_card c3 pile3 c25)
   deleted: (card_in_hand c3) (top_pile_card pile3 c25)
   added: (top_pile_card pile3 c3)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
26. (draw_card c42 c6)
   deleted: (top_deck_card c42)
   added: (top_deck_card c6) (card_in_hand c42) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
27. (draw_card c6 c29)
   deleted: (top_deck_card c6)
   added: (top_deck_card c29) (card_in_hand c6)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
28. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
29. (play_card c6 pile2 c14)
   deleted: (card_in_hand c6) (top_pile_card pile2 c14)
   added: (top_pile_card pile2 c6)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
30. (play_card c26 pile1 c_min)
   deleted: (card_in_hand c26) (top_pile_card pile1 c_min)
   added: (top_pile_card pile1 c26)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
31. (draw_card c29 c28)
   deleted: (top_deck_card c29)
   added: (top_deck_card c28) (card_in_hand c29) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
32. (draw_card c28 c8)
   deleted: (top_deck_card c28)
   added: (top_deck_card c8) (card_in_hand c28)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
33. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
34. (play_card c28 pile1 c26)
   deleted: (card_in_hand c28) (top_pile_card pile1 c26)
   added: (top_pile_card pile1 c28)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
35. (play_card c29 pile1 c28)
   deleted: (card_in_hand c29) (top_pile_card pile1 c28)
   added: (top_pile_card pile1 c29)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
36. (play_card c42 pile1 c29)
   deleted: (card_in_hand c42) (top_pile_card pile1 c29)
   added: (top_pile_card pile1 c42)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
37. (draw_card c8 c2)
   deleted: (top_deck_card c8)
   added: (top_deck_card c2) (card_in_hand c8) (is_drawing)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
38. (draw_card c2 c35)
   deleted: (top_deck_card c2)
   added: (top_deck_card c35) (card_in_hand c2)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
39. (draw_card c35 c44)
   deleted: (top_deck_card c35)
   added: (top_deck_card c44) (card_in_hand c35)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
40. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
41. (play_card c2 pile3 c3)
   deleted: (card_in_hand c2) (top_pile_card pile3 c3)
   added: (top_pile_card pile3 c2)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
42. (play_card c43 pile1 c42)
   deleted: (card_in_hand c43) (top_pile_card pile1 c42)
   added: (top_pile_card pile1 c43)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
43. (draw_card c44 c47)
   deleted: (top_deck_card c44)
   added: (top_deck_card c47) (card_in_hand c44) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
44. (draw_card c47 c48)
   deleted: (top_deck_card c47)
   added: (top_deck_card c48) (card_in_hand c47)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
45. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
46. (play_card c47 pile0 c45)
   deleted: (card_in_hand c47) (top_pile_card pile0 c45)
   added: (top_pile_card pile0 c47)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
47. (play_card c44 pile1 c43)
   deleted: (card_in_hand c44) (top_pile_card pile1 c43)
   added: (top_pile_card pile1 c44)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
48. (draw_card c48 c39)
   deleted: (top_deck_card c48)
   added: (top_deck_card c39) (card_in_hand c48) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
49. (draw_card c39 c5)
   deleted: (top_deck_card c39)
   added: (top_deck_card c5) (card_in_hand c39)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
50. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
51. (play_card c39 pile1 c44)
   deleted: (card_in_hand c39) (top_pile_card pile1 c44)
   added: (top_pile_card pile1 c39)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
52. (play_card c48 pile0 c47)
   deleted: (card_in_hand c48) (top_pile_card pile0 c47)
   added: (top_pile_card pile0 c48)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
53. (draw_card c5 c9)
   deleted: (top_deck_card c5)
   added: (top_deck_card c9) (card_in_hand c5) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
54. (draw_card c9 c41)
   deleted: (top_deck_card c9)
   added: (top_deck_card c41) (card_in_hand c9)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
55. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
56. (play_card c5 pile2 c6)
   deleted: (card_in_hand c5) (top_pile_card pile2 c6)
   added: (top_pile_card pile2 c5)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
57. (play_card c10 pile2 c5)
   deleted: (card_in_hand c10) (top_pile_card pile2 c5)
   added: (top_pile_card pile2 c10)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
58. (play_card c9 pile2 c10)
   deleted: (card_in_hand c9) (top_pile_card pile2 c10)
   added: (top_pile_card pile2 c9)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
59. (play_card c8 pile2 c9)
   deleted: (card_in_hand c8) (top_pile_card pile2 c9)
   added: (top_pile_card pile2 c8)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
60. (draw_card c41 c13)
   deleted: (top_deck_card c41)
   added: (top_deck_card c13) (card_in_hand c41) (is_drawing)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
61. (draw_card c13 c18)
   deleted: (top_deck_card c13)
   added: (top_deck_card c18) (card_in_hand c13)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
62. (draw_card c18 c27)
   deleted: (top_deck_card c18)
   added: (top_deck_card c27) (card_in_hand c18)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
63. (draw_card c27 c23)
   deleted: (top_deck_card c27)
   added: (top_deck_card c23) (card_in_hand c27)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
64. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
65. (play_card c13 pile2 c8)
   deleted: (card_in_hand c13) (top_pile_card pile2 c8)
   added: (top_pile_card pile2 c13)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
66. (play_card c18 pile2 c13)
   deleted: (card_in_hand c18) (top_pile_card pile2 c13)
   added: (top_pile_card pile2 c18)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
67. (draw_card c23 c30)
   deleted: (top_deck_card c23)
   added: (top_deck_card c30) (card_in_hand c23) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
68. (draw_card c30 c40)
   deleted: (top_deck_card c30)
   added: (top_deck_card c40) (card_in_hand c30)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
69. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
70. (play_card c23 pile2 c18)
   deleted: (card_in_hand c23) (top_pile_card pile2 c18)
   added: (top_pile_card pile2 c23)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
71. (play_card c17 pile2 c23)
   deleted: (card_in_hand c17) (top_pile_card pile2 c23)
   added: (top_pile_card pile2 c17)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
72. (draw_card c40 c7)
   deleted: (top_deck_card c40)
   added: (top_deck_card c7) (card_in_hand c40) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
73. (draw_card c7 c11)
   deleted: (top_deck_card c7)
   added: (top_deck_card c11) (card_in_hand c7)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
74. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
75. (play_card c7 pile2 c17)
   deleted: (card_in_hand c7) (top_pile_card pile2 c17)
   added: (top_pile_card pile2 c7)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
76. (play_card c40 pile1 c39)
   deleted: (card_in_hand c40) (top_pile_card pile1 c39)
   added: (top_pile_card pile1 c40)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
77. (draw_card c11 c38)
   deleted: (top_deck_card c11)
   added: (top_deck_card c38) (card_in_hand c11) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
78. (draw_card c38 c12)
   deleted: (top_deck_card c38)
   added: (top_deck_card c12) (card_in_hand c38)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
79. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
80. (play_card c35 pile1 c40)
   deleted: (card_in_hand c35) (top_pile_card pile1 c40)
   added: (top_pile_card pile1 c35)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
81. (play_card c30 pile1 c35)
   deleted: (card_in_hand c30) (top_pile_card pile1 c35)
   added: (top_pile_card pile1 c30)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
82. (draw_card c12 c4)
   deleted: (top_deck_card c12)
   added: (top_deck_card c4) (card_in_hand c12) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
83. (draw_card c4 c22)
   deleted: (top_deck_card c4)
   added: (top_deck_card c22) (card_in_hand c4)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
84. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
85. (play_card c12 pile2 c7)
   deleted: (card_in_hand c12) (top_pile_card pile2 c7)
   added: (top_pile_card pile2 c12)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
86. (play_card c11 pile2 c12)
   deleted: (card_in_hand c11) (top_pile_card pile2 c12)
   added: (top_pile_card pile2 c11)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
87. (draw_card c22 c36)
   deleted: (top_deck_card c22)
   added: (top_deck_card c36) (card_in_hand c22) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
88. (draw_card c36 c33)
   deleted: (top_deck_card c36)
   added: (top_deck_card c33) (card_in_hand c36)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
89. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
90. (play_card c16 pile2 c11)
   deleted: (card_in_hand c16) (top_pile_card pile2 c11)
   added: (top_pile_card pile2 c16)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
91. (play_card c41 pile1 c30)
   deleted: (card_in_hand c41) (top_pile_card pile1 c30)
   added: (top_pile_card pile1 c41)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
92. (play_card c36 pile1 c41)
   deleted: (card_in_hand c36) (top_pile_card pile1 c41)
   added: (top_pile_card pile1 c36)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
93. (play_card c38 pile1 c36)
   deleted: (card_in_hand c38) (top_pile_card pile1 c36)
   added: (top_pile_card pile1 c38)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 0 of 2
94. (draw_card c33 c24)
   deleted: (top_deck_card c33)
   added: (top_deck_card c24) (card_in_hand c33) (is_drawing)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
95. (draw_card c24 c15)
   deleted: (top_deck_card c24)
   added: (top_deck_card c15) (card_in_hand c24)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
96. (draw_card c15 c21)
   deleted: (top_deck_card c15)
   added: (top_deck_card c21) (card_in_hand c15)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
97. (draw_card c21 c19)
   deleted: (top_deck_card c21)
   added: (top_deck_card c19) (card_in_hand c21)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
98. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
99. (play_card c21 pile2 c16)
   deleted: (card_in_hand c21) (top_pile_card pile2 c16)
   added: (top_pile_card pile2 c21)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
100. (play_card c33 pile1 c38)
   deleted: (card_in_hand c33) (top_pile_card pile1 c38)
   added: (top_pile_card pile1 c33)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
101. (draw_card c19 c34)
   deleted: (top_deck_card c19)
   added: (top_deck_card c34) (card_in_hand c19) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
102. (draw_card c34 c46)
   deleted: (top_deck_card c34)
   added: (top_deck_card c46) (card_in_hand c34)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
103. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
104. (play_card c34 pile1 c33)
   deleted: (card_in_hand c34) (top_pile_card pile1 c33)
   added: (top_pile_card pile1 c34)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
105. (play_card c19 pile2 c21)
   deleted: (card_in_hand c19) (top_pile_card pile2 c21)
   added: (top_pile_card pile2 c19)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
106. (play_card c24 pile2 c19)
   deleted: (card_in_hand c24) (top_pile_card pile2 c19)
   added: (top_pile_card pile2 c24)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
107. (draw_card c46 c49)
   deleted: (top_deck_card c46)
   added: (top_deck_card c49) (card_in_hand c46) (is_drawing)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
108. (draw_final_card c49)
   deleted: (top_deck_card c49) (is_drawing)
   added: (card_in_hand c49) (deck_empty)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 1 of 2
109. (play_card c49 pile0 c48)
   deleted: (card_in_hand c49) (top_pile_card pile0 c48)
   added: (top_pile_card pile0 c49)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 1 of 2
110. (play_card c46 pile1 c34)
   deleted: (card_in_hand c46) (top_pile_card pile1 c34)
   added: (top_pile_card pile1 c46)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 1 of 2
111. (play_card c22 pile2 c24)
   deleted: (card_in_hand c22) (top_pile_card pile2 c24)
   added: (top_pile_card pile2 c22)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 1 of 2
112. (play_card c27 pile2 c22)
   deleted: (card_in_hand c27) (top_pile_card pile2 c22)
   added: (top_pile_card pile2 c27)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 1 of 2
113. (play_card c15 pile2 c27)
   deleted: (card_in_hand c15) (top_pile_card pile2 c27)
   added: (top_pile_card pile2 c15)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 1 of 2
114. (play_card c4 pile2 c15)
   deleted: (card_in_hand c4) (top_pile_card pile2 c15)
   added: (top_pile_card pile2 c4)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 2 of 2
